# Pandas-DataFrames

In [4]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df=pd.DataFrame(randn(5,4),["a","b","c","d","e"],["w","x","y","z"]) #data,index,columns

In [8]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [9]:
df["w"] #get column w it is a series

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [10]:
#selecting columns

In [11]:
type(df["w"])

pandas.core.series.Series

In [12]:
df[["w","z"]] # to get 2 colums just pass a list

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [13]:
df["new"]=df["w"] + df["z"] #adding new columns

In [14]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [15]:
df.drop("w", axis=1) # wurde nicht vom  echten gedroppt

          x         y         z       new
a  0.628133  0.907969  0.503826  3.210676
b -0.319318 -0.848077  0.605965  1.257083
c  0.740122  0.528813 -0.589001 -2.607169
d -0.758872 -0.933237  0.955057  1.143752
e  1.978757  2.605967  0.683509  0.874303

In [16]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [17]:
df.drop("a",axis=0)

          w         x         y         z       new
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [18]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [19]:
df.drop("new",axis=1,inplace=True) # mit inplace =true wird es vom echten auch gedroppt

In [20]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [21]:
df.drop("a",axis=0)  # to drop a row axis 0

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [22]:
#rows are axis=0 , columns are axis= 1  //rule

In [23]:
df.shape

(5, 4)

In [24]:
#selecting rows

In [25]:
df.loc["e"] # give the name of row

w    0.190794
x    1.978757
y    2.605967
z    0.683509
Name: e, dtype: float64

In [26]:
df.iloc[4] # index based loc give the index of row

w    0.190794
x    1.978757
y    2.605967
z    0.683509
Name: e, dtype: float64

In [27]:
df.loc[["b","a"]] # get 2 rows.

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
a  2.706850  0.628133  0.907969  0.503826

In [28]:
df.loc["b","x"] # get value at point

-0.31931804459303326

In [29]:
df.iloc[1,1] # get value with index at point

-0.31931804459303326

In [30]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [31]:
df.iloc[2:,:] # get subpart of df

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [32]:
df.loc[["c","d","e"],["w","x","y","z"]] # get subpart with names

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [33]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [34]:
# conditional selection

In [35]:
booldf=df>0

In [36]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [38]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [39]:
df["w"]>0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [40]:
df[df["w"]>0] # hangi rowlarda w 0 dan büyük, a,b,e. Artaık sadece abe kullan
#mesela satış=w sadece satısın oldugu günleri göster

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [55]:
df[df["w"]>0]["x"] # immer das prinzip mit row und column

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [62]:
df.loc["a"]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [61]:
df[df["w"]>0][["x","y"]]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

In [43]:
result=df[df["w"]>0][:]

In [44]:
result

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [45]:
#multiple conditions use not "and" use &

In [64]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [67]:
df[(df["x"]<2) & (df["z"]<1)][1:]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [48]:
df[(df["x"]<2) & (df["z"]>1)][["x","y"]]

Empty DataFrame
Columns: [x, y]
Index: []

In [49]:
df[(df["x"]<2) | (df["z"]>1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [50]:
#reseting index or set index to something else

In [105]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [116]:
df.reset_index()

  index         w         x         y         z states
0     a  0.386030  2.084019 -0.376519  0.230336     ca
1     b  0.681209  1.035125 -0.031160  1.939932     ny
2     c -1.005187 -0.741790  0.187125 -0.732845     wy
3     d -1.382920  1.482495  0.961458 -2.141212     or
4     e  0.992573  1.192241 -1.046780  1.292765     co

In [117]:
df

          w         x         y         z states
a  0.386030  2.084019 -0.376519  0.230336     ca
b  0.681209  1.035125 -0.031160  1.939932     ny
c -1.005187 -0.741790  0.187125 -0.732845     wy
d -1.382920  1.482495  0.961458 -2.141212     or
e  0.992573  1.192241 -1.046780  1.292765     co

In [118]:
newind=" ca ny wy or co".split()

In [119]:
newind

['ca', 'ny', 'wy', 'or', 'co']

In [120]:
df["states"]=newind

In [121]:
df

          w         x         y         z states
a  0.386030  2.084019 -0.376519  0.230336     ca
b  0.681209  1.035125 -0.031160  1.939932     ny
c -1.005187 -0.741790  0.187125 -0.732845     wy
d -1.382920  1.482495  0.961458 -2.141212     or
e  0.992573  1.192241 -1.046780  1.292765     co

In [122]:
df

          w         x         y         z states
a  0.386030  2.084019 -0.376519  0.230336     ca
b  0.681209  1.035125 -0.031160  1.939932     ny
c -1.005187 -0.741790  0.187125 -0.732845     wy
d -1.382920  1.482495  0.961458 -2.141212     or
e  0.992573  1.192241 -1.046780  1.292765     co

In [133]:
df.loc["f"]=[1,2,3,4,6]

In [134]:
df

          w         x         y         z states
a  0.386030  2.084019 -0.376519  0.230336     ca
b  0.681209  1.035125 -0.031160  1.939932     ny
c -1.005187 -0.741790  0.187125 -0.732845     wy
d -1.382920  1.482495  0.961458 -2.141212     or
e  0.992573  1.192241 -1.046780  1.292765     co
5  1.000000  2.000000  3.000000  4.000000      6
f  1.000000  2.000000  3.000000  4.000000      6

In [68]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [73]:
df=pd.DataFrame(randn(6,2),hier_index,["a","b"])

In [74]:
df

             a         b
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [76]:
df.loc["G1"].loc[1]

a    0.302665
b    1.693723
Name: 1, dtype: float64

In [77]:
df.index.names=["groups","nums"]

In [78]:
df

                    a         b
groups nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [79]:
df.loc["G2"].loc[2]["b"]

0.07295967531703869

In [ ]:
df.xs